/** 萬子 */
export type ManzuPai =
  | "m0"
  | "m1"
  | "m2"
  | "m3"
  | "m4"
  | "m5"
  | "m6"
  | "m7"
  | "m8"
  | "m9";

/** 筒子 */
export type PinzuPai =
  | "p0"
  | "p1"
  | "p2"
  | "p3"
  | "p4"
  | "p5"
  | "p6"
  | "p7"
  | "p8"
  | "p9";

/** 索子 */
export type SozuPai =
  | "s0"
  | "s1"
  | "s2"
  | "s3"
  | "s4"
  | "s5"
  | "s6"
  | "s7"
  | "s8"
  | "s9";

/**
 * 字牌
 * 東: z1
 * 南: z2
 * 西: z3
 * 北: z4
 * 白: z5
 * 發: z6
 * 中: z7
 * */
export type Jihai = "z1" | "z2" | "z3" | "z4" | "z5" | "z6" | "z7";

/** 牌 */
export type Pai = ManzuPai | PinzuPai | SozuPai | Jihai;

/** 牌姿を表現する文字列 */
export type Paishi = string;

/** 面子を表現する文字列 */
export type Mentsu = string;

/**
 * TODO: 使用するか要検討
 * ロン牌
 */
export type RonPai = ManzuRonPai | PinzuRonPai | SozuRonPai | JiRonPai;

/**
 * TODO: 使用するか要検討
 * 萬子(ロン牌)
 * ※ロン牌の末尾は誰からロン和了したかを表す記号が付与されている
 * 下家からのロン: +
 * 対面からのロン: =
 * 上家からのロン: -
 */
type ManzuRonPai =
  // 赤五萬
  | "m0+"
  | "m0="
  | "m0-"
  // 一萬
  | "m1+"
  | "m1="
  | "m1-"
  // 二萬
  | "m2+"
  | "m2="
  | "m2-"
  // 三萬
  | "m3+"
  | "m3="
  | "m3-"
  // 四萬
  | "m4+"
  | "m4="
  | "m4-"
  // 黒五萬
  | "m5+"
  | "m5="
  | "m5-"
  // 六萬
  | "m6+"
  | "m6="
  | "m6-"
  // 七萬
  | "m7+"
  | "m7="
  | "m7-"
  // 八萬
  | "m8+"
  | "m8="
  | "m8-"
  // 九萬
  | "m9+"
  | "m9="
  | "m9-";

/**
 * TODO: 使用するか要検討
 * 筒子(ロン牌)
 * ※ロン牌の末尾は誰からロン和了したかを表す記号が付与されている
 * 下家からのロン: +
 * 対面からのロン: =
 * 上家からのロン: -
 */
type PinzuRonPai =
  // 赤5筒
  | "p0+"
  | "p0="
  | "p0-"
  // 1筒
  | "p1+"
  | "p1="
  | "p1-"
  // 2筒
  | "p2+"
  | "p2="
  | "p2-"
  // 3筒
  | "p3+"
  | "p3="
  | "p3-"
  // 4筒
  | "p4+"
  | "p4="
  | "p4-"
  // 5筒
  | "p5+"
  | "p5="
  | "p5-"
  // 6筒
  | "p6+"
  | "p6="
  | "p6-"
  // 7筒
  | "p7+"
  | "p7="
  | "p7-"
  // 8筒
  | "p8+"
  | "p8="
  | "p8-"
  // 9筒
  | "p9+"
  | "p9="
  | "p9-";

/**
 * TODO: 使用するか要検討
 * 索子(ロン牌)
 * ※ロン牌の末尾は誰からロン和了したかを表す記号が付与されている
 * 下家からのロン: +
 * 対面からのロン: =
 * 上家からのロン: -
 */
type SozuRonPai =
  // 赤5索
  | "s0+"
  | "s0="
  | "s0-"
  // 1索
  | "s1+"
  | "s1="
  | "s1-"
  // 2索
  | "s2+"
  | "s2="
  | "s2-"
  // 3索
  | "s3+"
  | "s3="
  | "s3-"
  // 4索
  | "s4+"
  | "s4="
  | "s4-"
  // 黒5索
  | "s5+"
  | "s5="
  | "s5-"
  // 6索
  | "s6+"
  | "s6="
  | "s6-"
  // 7索
  | "s7+"
  | "s7="
  | "s7-"
  // 8索
  | "s8+"
  | "s8="
  | "s8-"
  // 9索
  | "s9+"
  | "s9="
  | "s9-";

/**
 * TODO: 使用するか要検討
 * 字牌のロン牌
 * ※ロン牌の末尾は誰からロン和了したかを表す記号が付与されている
 * 下家からのロン: +
 * 対面からのロン: =
 * 上家からのロン: -
 *
 * 東: z1
 * 南: z2
 * 西: z3
 * 北: z4
 * 白: z5
 * 發: z6
 * 中: z7
 * */
type JiRonPai =
  // 東
  | "z1+"
  | "z1="
  | "z1-"
  // 南
  | "z2+"
  | "z2="
  | "z2-"
  // 西
  | "z3+"
  | "z3="
  | "z3-"
  // 北
  | "z4+"
  | "z4="
  | "z4-"
  // 白
  | "z5+"
  | "z5="
  | "z5-"
  // 發
  | "z6+"
  | "z6="
  | "z6-"
  // 中
  | "z7+"
  | "z7="
  | "z7-";

export default Pai;
